school/third_year/cpsc370notes.org
* lecture 2
** relations
- a relation r from A to B is a subset of A x B
  - or sometimes (A, B, r) where r is a subset of A X B
- for a function the set A is called the domain and B is the co-domain

** functions
- a function f from A to B ( f: A->B) satisfies the two rules
  - (i) must answer every question
    - for all a in A there exists a b in B such that (a,b) is in f
  - (ii) one answer per question
    - for any a in A and any b1,b2 in B if (a,b1) and (a,b2) are both in f then b1=b2
- a partial function f from A to B is a relation that satisfies ii
  - relevant to cs because programming functions dont neccesarily have an answer for every value
- given finite sets A and B how many functions are there from A to B
  - |B^A| = |B|^|A|
- how many partial functions are there from A to B
  - add an unknown to B then the answer is (|B U {?}|^|A|)
    - like null
- how do we cope with multiple arguments in a function
  - mathematics treats multi-arg functions as functions from a cross-product
    - fourier: (Integers x Real numbers) -> Real numbers

* lecture 3
- currying is functions that return functions and is a way to deal with multiple argument functions
  - a function from AxB to C can be though of as a function from a to a function of B to C
  - named after a logistian Haskell Curry
    - invented by Schonfinkel (o has an umlout)
- two charateristics of a programming language that suggest it's functional are
  - anonymous functions
  - the ability to return functions from functions
- Haskell syntax
  - g (n,x) = sin (fromRational n * x)
    - can also include types by putting the following first g :(two colons) Int * Double -> Double
    - curried version: f n x = sin (fromRational n * x)
      - f3 = f(3)
      - f3(2.75)
  - -- is a comment in Haskell (minus minus)
- Scheme syntax
  - (define (g n x) (sin (* n x)))
    - (g 3 4.5)

* lecture 4
syntax notes for haskel
- funtion application is juxtaposition (placing next to eah other)
  - f (x) = x + 1
    - f (16)
    - or 'f 16' both are valid
  - juxtaposition binds very tightly
  - there is an operator '$' which has low precedence and binds right to left
- ordinary names in haskell consist of letters, numbers and _, with the usual rules
  - functions & variables have names that start with lower case letters
  - operator names
    - consist of !#$%&+_./*<=>?@\^|~ and :
- use function in an infix way by placing them in backticks
  - 3 `f` 1
- operators can be used in a prefix way by surrounding with ()
  - + 5 7
- syntactic sugar
  - makes a language sweeter
  - adds usability to a language without adding functionality
** DONE read learn you a haskell for great good chapter 2
** DONE question 1
   DEADLINE: <2016-10-04 Tue>
email
** DONE question 2
   DEADLINE: <2016-10-04 Tue>
explain how to write a function to return a*(x^2)+b*x+c
** DONE question 3
   DEADLINE: <2016-10-04 Tue>
write a curryed function to return the function x-> ax^2 + bx + c and execute it in 
- java
- haskell
- racket
* lecture 5
- basic list in functional languages
  - lists are singly linked
  - frequently immutable
  - made from cons cells and the empty list
    - cons cells are a pinter to a piece of data and the rest of the list
- static typing
  - a language is statically typed if you can work out the type of every expression at compile time
  - a language is statically typed if there is an algorithm to determine the type of the expression

** DONE question 4
   DEADLINE: <2016-10-04 Tue>
How many partial functions are there from { Scissors, Paper, Rock, Spock, Lizard } 2 to { Win, Lose } ?
How many of these are fair and interesting?
** DONE read chapters 3+4
* lecture 6
in functional languages functions are first class entities, first class means something like fully integrated into the
language
- first class
  - create literals and/or use without naming
  - use them as arguments or return types
  - store them in arrays and other data structures
  - read/write to/from files
  - compare for equality
  - order them
  - look inside their contents
- haskel function to determine length of a list
length [] = 0
length (_:xs) = 1 + length xs
- fib (not great)
fib n = if n == 0
        then 0
        else if n == 1
             then 1
             else fib(n-1) + fib(n-2)
- fib good
fib 0 = 0
fib 1 = 1
fib n = fib(n-1) + fib(n-2)
- another fib
fib n
   | n == 0    = 0    
   | n == 1    = 1    
   | n < 0     = undefined
   | otherwise = fib(n-1) + fib(n-2)
* lecture 7
  c(n) = 3n+1 if n is odd, n/2 if n is even
* lecture 8 
haskell merge sort:
mergeSort [] = []
mergeSort [x] = [x]
mergeSort xs = merge front back where
     front = mergeSort $ m `take` xs 
     back = mergeSort $ m `drop` xs
     m = length xs `div` 2
     merge [] ys = ys
     merge xs [] = xs
     merge (x:xs) (y:ys) =
         if y<x
	 then y : merge (x:xs) ys
	 else x : merge xs (y:ys)

- to use recursion
  1. I need a well ordered domain (for any subset there is a lease element)
  2. I need to know the answers for base cases
  3. I need to know how to link the answer of a general problem to the answer of a smaller problem
- 
* lecture 9
- homeworks 1-4 are due oct 4
- spent the whole class working on the same problem from lecture 7, started in haskell
