school/third_year/cpsc370notes.tex
% Created 2016-12-05 Mon 16:09
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Barry }
\date{\today}
\title{cpsc370notes}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{lecture 2}
\label{sec-1}
\subsection{relations}
\label{sec-1-1}
\begin{itemize}
\item a relation r from A to B is a subset of A x B
\begin{itemize}
\item or sometimes (A, B, r) where r is a subset of A X B
\end{itemize}
\item for a function the set A is called the domain and B is the co-domain
\end{itemize}

\subsection{functions}
\label{sec-1-2}
\begin{itemize}
\item a function f from A to B ( f: A->B) satisfies the two rules
\begin{itemize}
\item (i) must answer every question
\begin{itemize}
\item for all a in A there exists a b in B such that (a,b) is in f
\end{itemize}
\item (ii) one answer per question
\begin{itemize}
\item for any a in A and any b1,b2 in B if (a,b1) and (a,b2) are both in f then b1=b2
\end{itemize}
\end{itemize}
\item a partial function f from A to B is a relation that satisfies ii
\begin{itemize}
\item relevant to cs because programming functions dont neccesarily have an answer for every value
\end{itemize}
\item given finite sets A and B how many functions are there from A to B
\begin{itemize}
\item |B$^{\text{A|}}$ = |B|$^{\text{|A|}}$
\end{itemize}
\item how many partial functions are there from A to B
\begin{itemize}
\item add an unknown to B then the answer is (|B U \{?\}|$^{\text{|A|}}$)
\begin{itemize}
\item like null
\end{itemize}
\end{itemize}
\item how do we cope with multiple arguments in a function
\begin{itemize}
\item mathematics treats multi-arg functions as functions from a cross-product
\begin{itemize}
\item fourier: (Integers x Real numbers) -> Real numbers
\end{itemize}
\end{itemize}
\end{itemize}

\section{lecture 3}
\label{sec-2}
\begin{itemize}
\item currying is functions that return functions and is a way to deal with multiple argument functions
\begin{itemize}
\item a function from AxB to C can be though of as a function from a to a function of B to C
\item named after a logistian Haskell Curry
\begin{itemize}
\item invented by Schonfinkel (o has an umlout)
\end{itemize}
\end{itemize}
\item two charateristics of a programming language that suggest it's functional are
\begin{itemize}
\item anonymous functions
\item the ability to return functions from functions
\end{itemize}
\item Haskell syntax
\begin{itemize}
\item g (n,x) = sin (fromRational n * x)
\begin{itemize}
\item can also include types by putting the following first g :(two colons) Int * Double -> Double
\item curried version: f n x = sin (fromRational n * x)
\begin{itemize}
\item f3 = f(3)
\item f3(2.75)
\end{itemize}
\end{itemize}
\item -- is a comment in Haskell (minus minus)
\end{itemize}
\item Scheme syntax
\begin{itemize}
\item (define (g n x) (sin (* n x)))
\begin{itemize}
\item (g 3 4.5)
\end{itemize}
\end{itemize}
\end{itemize}

\section{lecture 4}
\label{sec-3}
syntax notes for haskel
\begin{itemize}
\item funtion application is juxtaposition (placing next to eah other)
\begin{itemize}
\item f (x) = x + 1
\begin{itemize}
\item f (16)
\item or 'f 16' both are valid
\end{itemize}
\item juxtaposition binds very tightly
\item there is an operator '\$' which has low precedence and binds right to left
\end{itemize}
\item ordinary names in haskell consist of letters, numbers and \_, with the usual rules
\begin{itemize}
\item functions \& variables have names that start with lower case letters
\item operator names
\begin{itemize}
\item consist of !\#\$\%\&+\_./*<=>?@$\backslash$$^{\text{|}}$\textasciitilde{} and :
\end{itemize}
\end{itemize}
\item use function in an infix way by placing them in backticks
\begin{itemize}
\item 3 `f` 1
\end{itemize}
\item operators can be used in a prefix way by surrounding with ()
\begin{itemize}
\item + 5 7
\end{itemize}
\item syntactic sugar
\begin{itemize}
\item makes a language sweeter
\item adds usability to a language without adding functionality
\end{itemize}
\end{itemize}
\subsection{{\bfseries\sffamily DONE} read learn you a haskell for great good chapter 2}
\label{sec-3-1}
\subsection{{\bfseries\sffamily DONE} question 1}
\label{sec-3-2}
email
\subsection{{\bfseries\sffamily DONE} question 2}
\label{sec-3-3}
explain how to write a function to return a*(x$^{\text{2}}$)+b*x+c
\subsection{{\bfseries\sffamily DONE} question 3}
\label{sec-3-4}
write a curryed function to return the function x-> ax$^{\text{2}}$ + bx + c and execute it in 
\begin{itemize}
\item java
\item haskell
\item racket
\end{itemize}
\section{lecture 5}
\label{sec-4}
\begin{itemize}
\item basic list in functional languages
\begin{itemize}
\item lists are singly linked
\item frequently immutable
\item made from cons cells and the empty list
\begin{itemize}
\item cons cells are a pinter to a piece of data and the rest of the list
\end{itemize}
\end{itemize}
\item static typing
\begin{itemize}
\item a language is statically typed if you can work out the type of every expression at compile time
\item a language is statically typed if there is an algorithm to determine the type of the expression
\end{itemize}
\end{itemize}

\subsection{{\bfseries\sffamily DONE} question 4}
\label{sec-4-1}
How many partial functions are there from \{ Scissors, Paper, Rock, Spock, Lizard \} 2 to \{ Win, Lose \} ?
How many of these are fair and interesting?
\subsection{{\bfseries\sffamily DONE} read chapters 3+4}
\label{sec-4-2}
\section{lecture 6}
\label{sec-5}
in functional languages functions are first class entities, first class means something like fully integrated into the
language
\begin{itemize}
\item first class
\begin{itemize}
\item create literals and/or use without naming
\item use them as arguments or return types
\item store them in arrays and other data structures
\item read/write to/from files
\item compare for equality
\item order them
\item look inside their contents
\end{itemize}
\item haskel function to determine length of a list
\end{itemize}
length [] = 0
length (\_:xs) = 1 + length xs
\begin{itemize}
\item fib (not great)
\end{itemize}
fib n = if n == 0
        then 0
        else if n == 1
             then 1
             else fib(n-1) + fib(n-2)
\begin{itemize}
\item fib good
\end{itemize}
fib 0 = 0
fib 1 = 1
fib n = fib(n-1) + fib(n-2)
\begin{itemize}
\item another fib
\end{itemize}
fib n
\begin{center}
\begin{tabular}{l}
n == 0    = 0\\
n == 1    = 1\\
n < 0     = undefined\\
otherwise = fib(n-1) + fib(n-2)\\
\end{tabular}
\end{center}
\section{lecture 7}
\label{sec-6}
c(n) = 3n+1 if n is odd, n/2 if n is even
\section{lecture 8}
\label{sec-7}
haskell merge sort:
mergeSort [] = []
mergeSort [x] = [x]
mergeSort xs = merge front back where
     front = mergeSort \$ m `take` xs 
     back = mergeSort \$ m `drop` xs
     m = length xs `div` 2
     merge [] ys = ys
     merge xs [] = xs
     merge (x:xs) (y:ys) =
         if y<x
         then y : merge (x:xs) ys
         else x : merge xs (y:ys)

\begin{itemize}
\item to use recursion
\begin{enumerate}
\item I need a well ordered domain (for any subset there is a lease element)
\item I need to know the answers for base cases
\item I need to know how to link the answer of a general problem to the answer of a smaller problem
\end{enumerate}
\item 
\end{itemize}
\section{lecture 9}
\label{sec-8}
\begin{itemize}
\item homeworks 1-4 are due oct 4
\item spent the whole class working on the same problem from lecture 7, started in haskell
\end{itemize}
