school/third_year/cpsc370notes.org
* lecture 10
how to write zip in haskel (takes two lists and returns a list of pairs)

zip _ [] = []
zip [] _ = []
zip (x:xs) (y:ys) = (x, y) : zip xs ys

- strict vs lazy languages
  - a language uses strict evaluation (is strict) if it always evaluates the arguments of a function 
    before evaluating the body of the function
  - a language is lazy if it  only evaluates function arguments when they are used

consider:
pi1 x y = x
badloop x = badloopx
pi1 true (badloop false)

in a lazy language we would get true in a strict language we get stuck forever

sq x = x * x
sq (sq (sq (sq (1+1) )))
-- a more haskelly way to do this would be
sq . sq .sq . sq $ 1 + 1
-- . is function composition

- a lazy language would multiply 1+1 many times because it would try to evaluate things one layer at a 
  time, a strongly typed language would multiply 1+1 once.
  - no real lazy language would actually do this, a well designed interpreter/compiler will make sure 
    arguments are computed 0 or 1 times

- scheme is strict
- haskell is lazy
- java is strict
- most languages are strict
- smart laziness involves only evaluating an argument at most once

(define (square x) (* x x))
(define (side-effect)
    (begin
    (displayln "Hi")
    2)) ;; returns 2 with the side effect of printing to the screen
(square (square side-effect))

- in a strict language Hi is printed once
- in a lazy language square will fracture multiple times an side effect would be called multiple times
  - sq (sq side-effect)
    - sq (side-effect * side-effect)
      - (side-effect * side-effect) * (side-effect * side-effect)
- laziness only makes sense in pure (non-side-effecting) languages
  - haskell is pure
- a "thunk" is either
  - a technique for creating a delayed computation (our use)
  - a way to implement run time method selection especially in multiple inheritance languages


- a thunk is one of two things
  - a way of delaying an operation (our use)
    - replace an expression with something that stands for it so we don't have to recompute a value
  - a way of picking a method in a multi-inheritance language

define f (Î» () (+ 2 3)) )
Racket boxes
box
unbox
setbox!

(define g (box 5))
(setbox! g "cat")

;; a box is like a one element array

g -> [] -> 5
     | 
     v
   "cat"

(define (delay f)
    (box (cons #false f))
)

(define (force g)
  (let ([contents (unbox g)])
  (if (car contents)
      (cdr contents)
      (let ([result ((cdr contents))])
           (setbox! g (cons #true result))
	   result)
  )
  )
)


-------------------------------------------------------
fib_nums = 0:1:zipWith (+) fib_nums (drop 1 fib_nums)

this is fine as long as we don't try to compute all of them
take 1000 fib_nums
would work fine

** DONE miderm
   DEADLINE: <2016-10-12 Wed>
- summarize laziness
- summarize strictness
- example where it makes a difference
- explain what a thunk is and why we use it
  - why do we have thunks in lazy languages
    - so we don't have to evaluate arguments multiple times
- which of the two languages we're studying are lazy
- which is statically typed
- why are functional languages tricky
- recursion

** DONE curry/uncurry functions
f x y = x+y
ff (x,y) = x+y

- in haskell write an uncurry function so that (uncurry f) is the samme as ff.
- in racket write a curry function

* lecture 11
- Environments
  - abstractly an environment is a dictionary mapping identifiers to their meanings at some particular time

public static int fact(int n) {
  if (n == 0)
     return 1;
  else return n * fact(n-1);
}

stack:
| fact | [3]n |               
| fact | [4]n | <- stack frame
| fact | [5]n |               
| .    |      |               
| .    |      |               
| .    |      |               
| main |      |               

- stacks work fine for when you just have flat functions, or even functions with functions inside of them 
  but when you start returning functions it gets a bit messy
- environments in languages with recursion but w/o functions returning functions are usually implemented with stacks

line (m, b) x = m * x + b

-- more explicit currying
line (m, b) = let 
     f y = m * y + b
     m f

line30 = line (3, 0)
line12 = line (1, 2)

line30 15 --what does the memory diagram look like here

- two ways of doing this
  - line30 calls the compiler and you compile some code
  - a function has a pair of pointers
    - a code pointer (points to code common to line30 and line12)
    - environment/closure pointer which points at some storage somewhere (probably the heap)
      that has what we want
* lecture 12
- live
  - data that will be used again
  - implies reachable
  - not computable
- dead
  - not that
  - not computable
- reachable
  - data you can find by following pointers starting from global and stack variables
  - computable
- unreachable
  - not that
  - implies dead
  - computable
- tail position
  - one chunk of sub-code is in tail position w.r.t. a surrounding piece of code if it will execute last
- a tail-call is a call that is in tail position (usually w.r.t. some function)
- at the point of a tail call the callee's environment s dead
- tail optimization is the act of removing the callee's environment before starting a tail call
- tail call optimization is just a call in a tail position, recursion isn't necessary
  - important in recursion because that's where you're getting a lot of stack frames
- 
* lecture 13 [2016-10-19 Wed]
- strategies for making tail recursive
  1. generalize
  2. use accumilator
  3. keep a list of work to do
- datatypes (haskel)
  datatype Tree a = Empty
                  | Branch a (Tree a)(Tree a) 
  fred :: Tree Int
  fred = Branch 3 (Branch 2 Empty Empty) Empty
  
  note: 
  fred =  3
         / \
        / [empty]
       2
      / \
     /   \
    /     \
 [empty] [empty]

 makeTree [] = Empty
 makeTree (x:xs) = Branch x Empty (makeTree xs) -- a long scragly tree, all to the right
 
 makeTree xs = let
          n = length xs
          m = (n-1) `div` 2
          ls = take m xs
          r:rs = drop m xs
          in Branch r (makeTree ls) (makeTree rs)

 countNodes [] = 0
 countNodes (Branch _ l r) = 1 + (countNodes l) + (countNodes r)
 
 countNode = helper 0 [] where
   helper acc list (Branch _ l r) =
     helper (acc + 1) (r:list) l
   helper acc list Empty = dispatch acc list
     dispatch acc [] = acc
     dispatch acc (tree:work) = helper acc work tree
