school/third_year/cpsc370notes.tex
\section{lecture 10}
\label{sec-9}
how to write zip in haskel (takes two lists and returns a list of pairs)

zip \_ [] = []
zip [] \_ = []
zip (x:xs) (y:ys) = (x, y) : zip xs ys

\begin{itemize}
\item strict vs lazy languages
\begin{itemize}
\item a language uses strict evaluation (is strict) if it always evaluates the arguments of a function 
before evaluating the body of the function
\item a language is lazy if it  only evaluates function arguments when they are used
\end{itemize}
\end{itemize}

consider:
pi1 x y = x
badloop x = badloopx
pi1 true (badloop false)

in a lazy language we would get true in a strict language we get stuck forever

sq x = x * x
sq (sq (sq (sq (1+1) )))
-- a more haskelly way to do this would be
sq . sq .sq . sq \$ 1 + 1
-- . is function composition

\begin{itemize}
\item a lazy language would multiply 1+1 many times because it would try to evaluate things one layer at a 
time, a strongly typed language would multiply 1+1 once.
\begin{itemize}
\item no real lazy language would actually do this, a well designed interpreter/compiler will make sure 
arguments are computed 0 or 1 times
\end{itemize}

\item scheme is strict
\item haskell is lazy
\item java is strict
\item most languages are strict
\item smart laziness involves only evaluating an argument at most once
\end{itemize}

(define (square x) (* x x))
(define (side-effect)
    (begin
    (displayln "Hi")
    2)) ;; returns 2 with the side effect of printing to the screen
(square (square side-effect))

\begin{itemize}
\item in a strict language Hi is printed once
\item in a lazy language square will fracture multiple times an side effect would be called multiple times
\begin{itemize}
\item sq (sq side-effect)
\begin{itemize}
\item sq (side-effect * side-effect)
\begin{itemize}
\item (side-effect * side-effect) * (side-effect * side-effect)
\end{itemize}
\end{itemize}
\end{itemize}
\item laziness only makes sense in pure (non-side-effecting) languages
\begin{itemize}
\item haskell is pure
\end{itemize}
\item a "thunk" is either
\begin{itemize}
\item a technique for creating a delayed computation (our use)
\item a way to implement run time method selection especially in multiple inheritance languages
\end{itemize}
\end{itemize}


\begin{itemize}
\item a thunk is one of two things
\begin{itemize}
\item a way of delaying an operation (our use)
\begin{itemize}
\item replace an expression with something that stands for it so we don't have to recompute a value
\end{itemize}
\item a way of picking a method in a multi-inheritance language
\end{itemize}
\end{itemize}

define f (Î» () (+ 2 3)) )
Racket boxes
box
unbox
setbox!

(define g (box 5))
(setbox! g "cat")

;; a box is like a one element array

g -> [] -> 5
\begin{center}
\begin{tabular}{}
\\
\end{tabular}
\end{center}
  v
"cat"

(define (delay f)
    (box (cons \#false f))
)

(define (force g)
  (let ([contents (unbox g)])
  (if (car contents)
      (cdr contents)
      (let ([result ((cdr contents))])
           (setbox! g (cons \#true result))
           result)
  )
  )
)


\rule{\linewidth}{0.5pt}
fib$_{\text{nums}}$ = 0:1:zipWith (+) fib$_{\text{nums}}$ (drop 1 fib$_{\text{nums}}$)

this is fine as long as we don't try to compute all of them
take 1000 fib$_{\text{nums}}$
would work fine

\subsection{{\bfseries\sffamily DONE} miderm}
\label{sec-9-1}
\begin{itemize}
\item summarize laziness
\item summarize strictness
\item example where it makes a difference
\item explain what a thunk is and why we use it
\begin{itemize}
\item why do we have thunks in lazy languages
\begin{itemize}
\item so we don't have to evaluate arguments multiple times
\end{itemize}
\end{itemize}
\item which of the two languages we're studying are lazy
\item which is statically typed
\item why are functional languages tricky
\item recursion
\end{itemize}

\subsection{{\bfseries\sffamily DONE} curry/uncurry functions}
\label{sec-9-2}
f x y = x+y
ff (x,y) = x+y

\begin{itemize}
\item in haskell write an uncurry function so that (uncurry f) is the samme as ff.
\item in racket write a curry function
\end{itemize}

\section{lecture 11}
\label{sec-10}
\begin{itemize}
\item Environments
\begin{itemize}
\item abstractly an environment is a dictionary mapping identifiers to their meanings at some particular time
\end{itemize}
\end{itemize}

public static int fact(int n) \{
  if (n == 0)
     return 1;
  else return n * fact(n-1);
\}

stack:
\begin{center}
\begin{tabular}{ll}
fact & \footnotemarkn\\
fact & \footnotemarkn & <- stack frame\\
fact & \footnotemarkn\\
. & \\
. & \\
. & \\
main & \\
\end{tabular}
\end{center}\footnotetext[1]{DEFINITION NOT FOUND.}\footnotetext[2]{DEFINITION NOT FOUND.}\footnotetext[3]{DEFINITION NOT FOUND.}

\begin{itemize}
\item stacks work fine for when you just have flat functions, or even functions with functions inside of them 
but when you start returning functions it gets a bit messy
\item environments in languages with recursion but w/o functions returning functions are usually implemented with stacks
\end{itemize}

line (m, b) x = m * x + b

-- more explicit currying
line (m, b) = let 
     f y = m * y + b
     m f

line30 = line (3, 0)
line12 = line (1, 2)

line30 15 --what does the memory diagram look like here

\begin{itemize}
\item two ways of doing this
\begin{itemize}
\item line30 calls the compiler and you compile some code
\item a function has a pair of pointers
\begin{itemize}
\item a code pointer (points to code common to line30 and line12)
\item environment/closure pointer which points at some storage somewhere (probably the heap)
that has what we want
\end{itemize}
\end{itemize}
\end{itemize}
\section{lecture 12}
\label{sec-11}
\begin{itemize}
\item live
\begin{itemize}
\item data that will be used again
\item implies reachable
\item not computable
\end{itemize}
\item dead
\begin{itemize}
\item not that
\item not computable
\end{itemize}
\item reachable
\begin{itemize}
\item data you can find by following pointers starting from global and stack variables
\item computable
\end{itemize}
\item unreachable
\begin{itemize}
\item not that
\item implies dead
\item computable
\end{itemize}
\item tail position
\begin{itemize}
\item one chunk of sub-code is in tail position w.r.t. a surrounding piece of code if it will execute last
\end{itemize}
\item a tail-call is a call that is in tail position (usually w.r.t. some function)
\item at the point of a tail call the callee's environment s dead
\item tail optimization is the act of removing the callee's environment before starting a tail call
\item tail call optimization is just a call in a tail position, recursion isn't necessary
\begin{itemize}
\item important in recursion because that's where you're getting a lot of stack frames
\end{itemize}
\item 
\end{itemize}
\section{lecture 13 \textit{[2016-10-19 Wed]}}
\label{sec-12}
\begin{itemize}
\item strategies for making tail recursive
\begin{enumerate}
\item generalize
\item use accumilator
\item keep a list of work to do
\end{enumerate}
\item datatypes (haskel)
datatype Tree a = Empty
\begin{center}
\begin{tabular}{l}
Branch a (Tree a)(Tree a)\\
\end{tabular}
\end{center}
fred :: Tree Int
fred = Branch 3 (Branch 2 Empty Empty) Empty

 note: 
 fred =  3
        / $\backslash$
       / [empty]
      2
     / $\backslash$
    /   $\backslash$
   /     $\backslash$
[empty] [empty]

makeTree [] = Empty
makeTree (x:xs) = Branch x Empty (makeTree xs) -- a long scragly tree, all to the right

makeTree xs = let
         n = length xs
         m = (n-1) `div` 2
         ls = take m xs
         r:rs = drop m xs
         in Branch r (makeTree ls) (makeTree rs)

countNodes [] = 0
countNodes (Branch \_ l r) = 1 + (countNodes l) + (countNodes r)

countNode = helper 0 [] where
  helper acc list (Branch \_ l r) =
    helper (acc + 1) (r:list) l
  helper acc list Empty = dispatch acc list
    dispatch acc [] = acc
    dispatch acc (tree:work) = helper acc work tree
\end{itemize}
