school/third_year/cpsc370notes.org
* lecture 15 [2016-10-31 Mon]
- monads
  - ?
- persistent
  - cant see it change
  - ownership issues are gone
  - data can be shared
  - copies can be shallow
  - equality can be reduced to pointer equality (with work)
- ephemeral
  - can see it change
  - some classical data stuctures (array) have no obvious persistent analog
  - classical algorithms need to be adapted to persistent data structures
- persistent data structures allow us to think in new ways
* lecture 16 [2016-11-02 Wed]
Queue:
data Queue a = Q[a][a][a] -- Q head, worker, tail
-- the length of the head == length of the worker + the length of tail
* lecture 17 [2016-11-04 Fri]
- Monad
  - has the following functions
    return :: a -> m a -- takes a something to a container of somethings
    (>>=) :: m a -> (a -> m b) -> m b
  - once you have a monad you can use do notation
  - lists as monads
    return a = [a]
    aList >>= f = concat(map f aList)
  - do
    - do
       a <- [10,20,30]
       b <- [1,2]
       return $ a + b
      - syntactic sugar for
	  [10,20,30] >>= (\ a ->
            [1,2] >>= (\ b -> [a+b]))
** DONE midterm exam
   DEADLINE: <2016-11-07 Mon>
- recursion
- tail position
- tail call
  - what's special about them?
  - garbage collection
  - how do they impact time and space
- liveness
- deadness
- tail recursion
  - how?
    - generalize
    - list of sub problems
    - accumalator
    - continuations
- continuations
- static vs dynamic binding
  - static means you look around the code
  - dynamic means you go up the call stack
  - how do scheme and haskell use by default (static)
- paramertarize
  - force dynamic 
- persistent vs ephemeral
  - what is an example of a persistent Java class (will be on midterm)
    - String
  - how would you make a persistent queue in Haskell
    - use at least two lists, a head and a reverse tail
- haskell type classes
  - how to define
  - instances
  - what is a Monad
    - why is it special
    - desugar a do block
* lecture 18 [2016-11-09 Wed]
- 
* lecture 19 [2016-11-14 Mon]
- haskell
  - f x = 3 * x + 1
- prolog
  - f(X, Y) :- Y is 3 * X + 1.
    - uppercase is a variable
    - is operator numerically evaluates its righthand side then the expression is true if both sides are equal
    - syntactic sugar for '+'('*'(3,x),1)
  - prolog is relational not functional
  - ?- f(3,11).
    - False
  - ?- f(3, 10).
    - True
  - ?- f(3, A).
    - A = 10
  - f(X, 10).
    - an error
  - ?- append(X, [4,5,6], [1,2,3,4,5,6]).
    - X = [1,2,3]
  - ?- append(X, X, [1,2,3,4,5,6]).
    - False
  - ?- append(X, Y, [1,2,3,4,5,6]).
    - X = [], Y = [1..6];
  - n1.
    - is just a fact which is equivalent to ..
      - n1().
  - fat(cat, fred(2, 3+1))
    - an assertion
  - "think of prolog like partially digested natural language"
  - 
  - directlyNorthOf(pg, redRock).
  - directlyNorthOf(redRock, stoner).
  - directlyNorthOf(stoner, hixon).
  - directlyNorthOf(hixon, quesnel)
  - northOf(X, Y) :- directlyNorthOf(X, Y).
  - northOf(X, Y) :- directlyNorthOf(X, Z), northOf(Z, Y).
  - 
  - prolog is all about universal horn clauses, where a universal horn clause is a universally 
    quantified disjunction of atomic clauses, all but one of which is negated
  - practical notes
    - ?- is the prompt in the interpreter
    - ?- consult("filename.pl"). will read a file
    - ?- make. will reconsult anything that's been consulted in this session
    - ?- help(help). should give you a gui based browser
* lecture 20 [2016-11-16 Wed]
- prolog syntax
  - comments
    - /*block comments*/
    - % line comments
  - strings are "double quoted" with \ escapes
  - `backticks are a string made of a list of chars'
  - Variables start with Capitals
  - _ is a wildcard
  - atoms start with lowercase letters or can be quoted with 'single quotes'
  - lists are built using [] (empty) and [.|.] (cons) with lots of sugar support
    - ex: [1,2,3] = [1 | [2 | [3 | [] ] ] ]
- prolog append
  append([], Ys, Ys).
  append([X|Xs], Ys, [X|Zs]) :- append(Xs, Ys, Zs).
- 
- λ-calculus
  - (λ (x) (λ (y) (λ (z) ... )))
  - λx.(x is bound in here)
  - the pure λ-calculus is built from variables, abstractions and applications f(x)
  - example
    - flip f x y = f y x
    - λfxy.[f(y)](x)
* lecture 21 [2016-11-19 Sat]
- α-conversion
  - if you change the name of a bound variable it should not change the meaning
    - λx.x should be the same as λy.y
- β-reduction is how the λ-calculus "works"
  - (λx.T)(A) ~~~~~> T[x/A]
    - replace each x in T with A
      - [λx.sin(x)](3) ~~~~~~~> sin(3)
      - [λx.(sin(x) + (λx.x)(5))](3)
- de Bruijn indices
  - look it up, seems important
- how do we represent λ-calculus in Prolog?
  - unbd(sin) unbound
  - app(unbd(sin),unbd(3)) apply
  - dB(3) de Bruijn indices
  - abstractions
    - abs(x, term) where x = string, term = λ-term
    - abs0(x, term) where x is a suggested variable name, term uses dB(N) for x
- natural numbers in λ-calc
  - two is λfx.f(f(x))
  - abs("f", abs0("x", app(dB(1), app(dB(1), dB(0)))))
- absToAbs0(Term1, Term2) :- absToAbs0(Term1, Term2, []).
  absToAbs0(app(F,X), app(F1, X1), List) :- 
    absToAbs0(F, F1, List),
    absToAbs0(x, X1, List).
  absToAbs0(unbd(X), unbd(X), _).
  absToAbs0(Q, dB(N), List) :-
    isVar(Q),
    nth0(N, List, Q).
  absToAbs0(abs(X, Term), abs0(X, Term1), List) :-
    absToAbs0(Term, Term1, [X|List]).
* lecture 22 [2016-11-21 Mon]
** lambda calc turing machine
T : λxy.x
F : λxy.y
if : λxyz.xyz
and : λpq.if(p)(q)(F)

pair : λab.λc.if(c)(a)(b)
first : λp.p(T)
second : λp.p(F)

from now on pairs are
<a, b> = pair(a)(b)
p1 = first(p)

empty : <F,F>
cons : λab.<T,<a,B>>
empty? : λd.not(d1)
cons? : λd.d1
car : λd.(d2)1 
cdr : λd.(d2)2

** numbers (do a thing n times)
0: λfx.x
1: λfx.f(x)
2: λfx.f(f(x))

zero: λN.N(λx.F)(T)
add1: λNfx:Nf(f(x))

operators
+: λmn.λfx.m(f)(nfx)
*: λmn.λfx.m(nf)x






** recursion
how to do recursion without recursive function definitions. the μ (or Y) combinator

length [] = 0
length (_:xs) = 1 + length xs

ellImprov f [] = 0
ellImprov f (_:xs) = 1 + f xs

ellImprov length = length
ellImprov undefined = {[] -> 0, otherwise -> undefined}

ellImprov ellImprov (ellImprov undefined) = {correct for length <= 1, otherwise undefined}
allImprov^(1000) undefinied = {correct up to length 999}

μ gg x = gg (μ gg)x

