school/third_year/cpsc370notes.tex
\section{lecture 15 \textit{[2016-10-31 Mon]}}
\label{sec-13}
\begin{itemize}
\item monads
\begin{itemize}
\item ?
\end{itemize}
\item persistent
\begin{itemize}
\item cant see it change
\item ownership issues are gone
\item data can be shared
\item copies can be shallow
\item equality can be reduced to pointer equality (with work)
\end{itemize}
\item ephemeral
\begin{itemize}
\item can see it change
\item some classical data stuctures (array) have no obvious persistent analog
\item classical algorithms need to be adapted to persistent data structures
\end{itemize}
\item persistent data structures allow us to think in new ways
\end{itemize}
\section{lecture 16 \textit{[2016-11-02 Wed]}}
\label{sec-14}
Queue:
data Queue a = Q[a][a][a] -- Q head, worker, tail
-- the length of the head == length of the worker + the length of tail
\section{lecture 17 \textit{[2016-11-04 Fri]}}
\label{sec-15}
\begin{itemize}
\item Monad
\begin{itemize}
\item has the following functions
return :: a -> m a -- takes a something to a container of somethings
(>>=) :: m a -> (a -> m b) -> m b
\item once you have a monad you can use do notation
\item lists as monads
return a = [a]
aList >>= f = concat(map f aList)
\item do
\begin{itemize}
\item do
a <- [10,20,30]
b <- [1,2]
return \$ a + b
\begin{itemize}
\item syntactic sugar for
[10,20,30] >>= ($\backslash$ a ->
  [1,2] >>= ($\backslash$ b -> [a+b]))
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{{\bfseries\sffamily DONE} midterm exam}
\label{sec-15-1}
\begin{itemize}
\item recursion
\item tail position
\item tail call
\begin{itemize}
\item what's special about them?
\item garbage collection
\item how do they impact time and space
\end{itemize}
\item liveness
\item deadness
\item tail recursion
\begin{itemize}
\item how?
\begin{itemize}
\item generalize
\item list of sub problems
\item accumalator
\item continuations
\end{itemize}
\end{itemize}
\item continuations
\item static vs dynamic binding
\begin{itemize}
\item static means you look around the code
\item dynamic means you go up the call stack
\item how do scheme and haskell use by default (static)
\end{itemize}
\item paramertarize
\begin{itemize}
\item force dynamic
\end{itemize}
\item persistent vs ephemeral
\begin{itemize}
\item what is an example of a persistent Java class (will be on midterm)
\begin{itemize}
\item String
\end{itemize}
\item how would you make a persistent queue in Haskell
\begin{itemize}
\item use at least two lists, a head and a reverse tail
\end{itemize}
\end{itemize}
\item haskell type classes
\begin{itemize}
\item how to define
\item instances
\item what is a Monad
\begin{itemize}
\item why is it special
\item desugar a do block
\end{itemize}
\end{itemize}
\end{itemize}
\section{lecture 18 \textit{[2016-11-09 Wed]}}
\label{sec-16}
\begin{itemize}
\item 
\end{itemize}
\section{lecture 19 \textit{[2016-11-14 Mon]}}
\label{sec-17}
\begin{itemize}
\item haskell
\begin{itemize}
\item f x = 3 * x + 1
\end{itemize}
\item prolog
\begin{itemize}
\item f(X, Y) :- Y is 3 * X + 1.
\begin{itemize}
\item uppercase is a variable
\item is operator numerically evaluates its righthand side then the expression is true if both sides are equal
\item syntactic sugar for '+'('*'(3,x),1)
\end{itemize}
\item prolog is relational not functional
\item ?- f(3,11).
\begin{itemize}
\item False
\end{itemize}
\item ?- f(3, 10).
\begin{itemize}
\item True
\end{itemize}
\item ?- f(3, A).
\begin{itemize}
\item A = 10
\end{itemize}
\item f(X, 10).
\begin{itemize}
\item an error
\end{itemize}
\item ?- append(X, [4,5,6], [1,2,3,4,5,6]).
\begin{itemize}
\item X = [1,2,3]
\end{itemize}
\item ?- append(X, X, [1,2,3,4,5,6]).
\begin{itemize}
\item False
\end{itemize}
\item ?- append(X, Y, [1,2,3,4,5,6]).
\begin{itemize}
\item X = [], Y = [1..6];
\end{itemize}
\item n1.
\begin{itemize}
\item is just a fact which is equivalent to ..
\begin{itemize}
\item n1().
\end{itemize}
\end{itemize}
\item fat(cat, fred(2, 3+1))
\begin{itemize}
\item an assertion
\end{itemize}
\item "think of prolog like partially digested natural language"
\item 
\item directlyNorthOf(pg, redRock).
\item directlyNorthOf(redRock, stoner).
\item directlyNorthOf(stoner, hixon).
\item directlyNorthOf(hixon, quesnel)
\item northOf(X, Y) :- directlyNorthOf(X, Y).
\item northOf(X, Y) :- directlyNorthOf(X, Z), northOf(Z, Y).
\item 
\item prolog is all about universal horn clauses, where a universal horn clause is a universally 
quantified disjunction of atomic clauses, all but one of which is negated
\item practical notes
\begin{itemize}
\item ?- is the prompt in the interpreter
\item ?- consult("filename.pl"). will read a file
\item ?- make. will reconsult anything that's been consulted in this session
\item ?- help(help). should give you a gui based browser
\end{itemize}
\end{itemize}
\end{itemize}
\section{lecture 20 \textit{[2016-11-16 Wed]}}
\label{sec-18}
\begin{itemize}
\item prolog syntax
\begin{itemize}
\item comments
\begin{itemize}
\item \emph{\textbf{block comments}}
\item \% line comments
\end{itemize}
\item strings are "double quoted" with $\backslash$ escapes
\item `backticks are a string made of a list of chars'
\item Variables start with Capitals
\item \_ is a wildcard
\item atoms start with lowercase letters or can be quoted with 'single quotes'
\item lists are built using [] (empty) and [.|.] (cons) with lots of sugar support
\begin{itemize}
\item ex: [1,2,3] = [1 | [2 | [3 | [] ] ] ]
\end{itemize}
\end{itemize}
\item prolog append
append([], Ys, Ys).
append([X|Xs], Ys, [X|Zs]) :- append(Xs, Ys, Zs).
\item 
\item λ-calculus
\begin{itemize}
\item (λ (x) (λ (y) (λ (z) \ldots{} )))
\item λx.(x is bound in here)
\item the pure λ-calculus is built from variables, abstractions and applications f(x)
\item example
\begin{itemize}
\item flip f x y = f y x
\item λfxy.[f(y)](x)
\end{itemize}
\end{itemize}
\end{itemize}
\section{lecture 21 \textit{[2016-11-19 Sat]}}
\label{sec-19}
\begin{itemize}
\item α-conversion
\begin{itemize}
\item if you change the name of a bound variable it should not change the meaning
\begin{itemize}
\item λx.x should be the same as λy.y
\end{itemize}
\end{itemize}
\item β-reduction is how the λ-calculus "works"
\begin{itemize}
\item (λx.T)(A) \textasciitilde{}~\textasciitilde{}~\textasciitilde{}> T[x/A]
\begin{itemize}
\item replace each x in T with A
\begin{itemize}
\item\relax [λx.sin(x)](3) \textasciitilde{}~\textasciitilde{}~\textasciitilde{}~\textasciitilde{}> sin(3)
\item\relax [λx.(sin(x) + (λx.x)(5))](3)
\end{itemize}
\end{itemize}
\end{itemize}
\item de Bruijn indices
\begin{itemize}
\item look it up, seems important
\end{itemize}
\item how do we represent λ-calculus in Prolog?
\begin{itemize}
\item unbd(sin) unbound
\item app(unbd(sin),unbd(3)) apply
\item dB(3) de Bruijn indices
\item abstractions
\begin{itemize}
\item abs(x, term) where x = string, term = λ-term
\item abs0(x, term) where x is a suggested variable name, term uses dB(N) for x
\end{itemize}
\end{itemize}
\item natural numbers in λ-calc
\begin{itemize}
\item two is λfx.f(f(x))
\item abs("f", abs0("x", app(dB(1), app(dB(1), dB(0)))))
\end{itemize}
\item absToAbs0(Term1, Term2) :- absToAbs0(Term1, Term2, []).
absToAbs0(app(F,X), app(F1, X1), List) :- 
  absToAbs0(F, F1, List),
  absToAbs0(x, X1, List).
absToAbs0(unbd(X), unbd(X), \_).
absToAbs0(Q, dB(N), List) :-
  isVar(Q),
  nth0(N, List, Q).
absToAbs0(abs(X, Term), abs0(X, Term1), List) :-
  absToAbs0(Term, Term1, [X|List]).
\end{itemize}
\section{lecture 22 \textit{[2016-11-21 Mon]}}
\label{sec-20}
\subsection{lambda calc turing machine}
\label{sec-20-1}
T : λxy.x
F : λxy.y
if : λxyz.xyz
and : λpq.if(p)(q)(F)

pair : λab.λc.if(c)(a)(b)
first : λp.p(T)
second : λp.p(F)

from now on pairs are
<a, b> = pair(a)(b)
p1 = first(p)

empty : <F,F>
cons : λab.<T,<a,B>>
empty? : λd.not(d1)
cons? : λd.d1
car : λd.(d2)1 
cdr : λd.(d2)2

\subsection{numbers (do a thing n times)}
\label{sec-20-2}
0: λfx.x
1: λfx.f(x)
2: λfx.f(f(x))

zero: λN.N(λx.F)(T)
add1: λNfx:Nf(f(x))

operators
+: λmn.λfx.m(f)(nfx)
*: λmn.λfx.m(nf)x






\subsection{recursion}
\label{sec-20-3}
how to do recursion without recursive function definitions. the μ (or Y) combinator

length [] = 0
length (\_:xs) = 1 + length xs

ellImprov f [] = 0
ellImprov f (\_:xs) = 1 + f xs

ellImprov length = length
ellImprov undefined = \{[] -> 0, otherwise -> undefined\}

ellImprov ellImprov (ellImprov undefined) = \{correct for length <= 1, otherwise undefined\}
allImprov$^{\text{(1000)}}$ undefinied = \{correct up to length 999\}

μ gg x = gg (μ gg)x
